In [1]:
import numpy as np
import pandas as pd

In [2]:
data=pd.read_csv('Churn_modelling.csv')

In [3]:
data.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [4]:
data['Exited'].value_counts()

0    7963
1    2037
Name: Exited, dtype: int64

In [5]:
data.isnull().sum()  # fillna method

RowNumber          0
CustomerId         0
Surname            0
CreditScore        0
Geography          0
Gender             0
Age                0
Tenure             0
Balance            0
NumOfProducts      0
HasCrCard          0
IsActiveMember     0
EstimatedSalary    0
Exited             0
dtype: int64

In [6]:
data.columns

Index(['RowNumber', 'CustomerId', 'Surname', 'CreditScore', 'Geography',
       'Gender', 'Age', 'Tenure', 'Balance', 'NumOfProducts', 'HasCrCard',
       'IsActiveMember', 'EstimatedSalary', 'Exited'],
      dtype='object')

#### Label Encoding

In [7]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
cat=['Geography','Gender']
for i in cat:
    data[i]=le.fit_transform(data[i])

In [8]:
data.shape

(10000, 14)

In [10]:
data.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,0,0,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,2,0,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,0,0,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,0,0,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,2,0,43,2,125510.82,1,1,1,79084.10,0

In [11]:
x=data.iloc[:,3:13]
y=data.iloc[:,[13]]

In [12]:
x.head()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
0,619,0,0,42,2,0.00,1,1,1,101348.88
1,608,2,0,41,1,83807.86,1,0,1,112542.58
2,502,0,0,42,8,159660.80,3,1,0,113931.57
3,699,0,0,39,1,0.00,2,0,0,93826.63
4,850,2,0,43,2,125510.82,1,1,1,79084.10

In [13]:
y.head()

   Exited
0       1
1       0
2       1
3       0
4       0

In [14]:
from sklearn.preprocessing import StandardScaler
ss=StandardScaler()
x=ss.fit_transform(x)

In [13]:
from sklearn.model_selection import  train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=0)

### ANN

keras and tensorflow

In [14]:
#pip install tensorflow
#pip install kears == 2.2.4

In [15]:
from keras.models import Sequential # intialize our model
from keras.layers import Dense # adding the layers

If in your system the tensorflow version is above 2.0 then 

from tensorflow.keras.models import Sequential # intialize our model
from tensorflow.keras.layers import Dense # adding the layers

In [16]:
model= Sequential() # creating the model

# creating the model

In [17]:
# input layer
model.add(Dense(12,activation="relu"))
# 1st hiddern layers
model.add(Dense(12,activation="relu"))
# 2nd hidden layers
model.add(Dense(24,activation="relu"))
# output layer
# task : when you have a regression problem what activation function is used in output layer.
model.add(Dense(1, activation='sigmoid'))

In [18]:
# 0 and 1 : binary_crossentropy
# more than 2 : categorical_crossentropy
# task : for regression which loss function is used ?
model.compile(optimizer="adam",loss="binary_crossentropy",metrics=['accuracy'])

In [19]:
x_train.shape

(8000, 10)

# fitting

In [20]:
model.fit(x_train,y_train,epochs=10,batch_size=32)

Epoch 1/10
250/250 [==============================] - 3s 2ms/step - loss: 0.4885 - accuracy: 0.7980
Epoch 2/10
250/250 [==============================] - 1s 3ms/step - loss: 0.4282 - accuracy: 0.8164
Epoch 3/10
250/250 [==============================] - 0s 2ms/step - loss: 0.4075 - accuracy: 0.8273
Epoch 4/10
250/250 [==============================] - 0s 2ms/step - loss: 0.3897 - accuracy: 0.8386
Epoch 5/10
250/250 [==============================] - 0s 2ms/step - loss: 0.3741 - accuracy: 0.8471
Epoch 6/10
250/250 [==============================] - 0s 2ms/step - loss: 0.3603 - accuracy: 0.8500
Epoch 7/10
250/250 [==============================] - 0s 2ms/step - loss: 0.3542 - accuracy: 0.8514
Epoch 8/10
250/250 [==============================] - 0s 2ms/step - loss: 0.3493 - accuracy: 0.8539
Epoch 9/10
250/250 [==============================] - 0s 2ms/step - loss: 0.3475 - accuracy: 0.8545
Epoch 10/10
250/250 [==============================] - 0s 2ms/step - loss: 0.3452 - accuracy: 0.8562

In [86]:
prediction=model.predict(x_test)

In [87]:
y_test[:5]

      Exited
9394       0
898        1
2398       0
5906       0
2343       0

In [88]:
prediction[:5]

array([[0.34180737],
       [0.39452735],
       [0.09230217],
       [0.07882285],
       [0.08217853]], dtype=float32)

In [89]:
predict=[]
for i in prediction:
    if i>0.5:
        predict.append(1)
    else:
        predict.append(0)

In [90]:
predict[:5]

[0, 0, 0, 0, 0]

In [91]:
from sklearn.metrics import confusion_matrix
confusion_matrix(y_test,predict)

array([[1499,   96],
       [ 201,  204]], dtype=int64)